src/models/ResetForm.php

    public function resetPassword(ResetForm $model, string $token): bool
    {
        if (!$this->validate()) {
            return false;
        }

        $user = User::findByPasswordResetToken($token);

        if (!$user instanceof User  ||
            $user->isEmailLinkExpired() ||
            $user->isDisabled()
        ) {
            return false;
        }

        $user->setPassword($model->password);
        $user->status = User::STATUS_ACTIVE;
        $user->save();
---
UPDATE `user` SET `status`=10, `password_hash`='$2y$13$PbdAICYa1ntTasI/nOxUVOfAb1XHdqCCLqx8RTM5CpoM7j7XbaDoC', `updated_at`='2026-01-20 10:04:03' WHERE `id`=6