src/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `user_type`, `domain_type`, `expires_at`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('admin2', 'admin2@test.com', 1, 1, '2026-01-20 10:17:17', '$2y$13$7QFa8C5qH84SF0YfKbRVsO.ATfGCSvf9mIB4qLy0Jk8DvwRoA2CXi', 'nF1lnAAbOMgjGk-mGJxTyxcx0FVrVtZA', 'gmfD1YCmA1r_9I91-j60LXrXqHvGL5v7_1768903337', 9, '2026-01-20 10:02:17', '2026-01-20 10:02:17')
---
    public function signup(): ?bool
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->user_type = $this->user_type;

        $user->domain_type = User::DSD_DOMAIN;
        $user->expires_at = (new \DateTime())->modify('+15 minutes')
            ->format('Y-m-d H:i:s');
        $user->setPassword(Yii::$app->security->generateRandomString());
        //$user->setPassword('password');
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();

        return $user->save() && $this->sendEmail($user);