src/models/User.php

    public static function findByUsername(string $email): ?User
    {
        return static::findOne(['username' => $email, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`email`='admin@test.com') AND (`status`=10)